# DATA CLEANING

In this notebook we are going to perform cleaning tasks to this messy csv by doing the following tasks:

- Remove columns that would not have any impact in our analysis
- Remove empety rows: In the exploratory notebook we noticed that we had nearly a 75% of empty rows 
- Perform changes within the columns so the variables are clean

## Importing libraries and data from the csv

In [1]:
import pandas as pd
import numpy as np 
import re

df = pd.read_csv(r"C:\Users\DavidVicente\Desktop\IronHack\Projects\Project 1\attacks.csv", encoding="latin")

## Remove non-wanted columns

After checking every single column of the dataframe we have found that some of the columns don't add any value, so we have decided to remove them. Here is a summary

- **Case Number** : For the name of the column you cound deduce that it contains an unique id, but it does not. This column is a "dirty version" of the column date, so we have decided to get rid of it. 
- **Unnamed: 22 & Unnamed** : 23: Both columns are empty, so we will also deleate them. 
- **Investigator or Source** : Name of the investigator or source won't be relevant for our analysis
- **pdf** : Not relevant. It is a concat of the name and date
- **href & href formula** : Contains a link with the pdf of the attack. We won't need it
- **Oringinal order**: No clue what this is 
- **Case number 1 & 2**: We will also get rid of these two columns

Index(['Case Number', 'Date', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex ', 'Age', 'Injury', 'Fatal (Y/N)', 'Time',
       'Species ', 'Investigator or Source', 'pdf', 'href formula', 'href',
       'Case Number.1', 'Case Number.2', 'original order', 'Unnamed: 22',
       'Unnamed: 23'],
      dtype='object')

### Dropping non-wanted columns

Now, we are going the get ridd of the columns shared before

Index(['Case Number', 'Date', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex ', 'Age', 'Injury', 'Fatal (Y/N)', 'Time',
       'Species ', 'Investigator or Source', 'pdf', 'href formula', 'href',
       'Case Number.1', 'Case Number.2', 'original order', 'Unnamed: 22',
       'Unnamed: 23'],
      dtype='object')

In [4]:
# using drop: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop.html

df.drop(["Case Number","Unnamed: 22","Unnamed: 23","Investigator or Source","pdf","href formula","href","original order","Case Number.1","Case Number.2" ],axis=1 ,inplace=True)

Index(['Date', 'Year', 'Type', 'Country', 'Area', 'Location', 'Activity',
       'Name', 'Sex ', 'Age', 'Injury', 'Fatal (Y/N)', 'Time', 'Species '],
      dtype='object')

## Removing empty rows

In the first exploratory analysis we saw that this df has a lot of nan values. Now, we will look at the exat number and remove all the rows that don't content any information at all.

### Checking proportion of nan values in the df

In [5]:
nan_values = round(100*(df.isnull().sum() / len(df)),2)
print(f"Percentage of nan values within the column: \n \n {nan_values}%")

Percentage of nan values within the column:

 Date           75.50
Year           75.51
Type           75.52
Country        75.69
Area           77.27
Location       77.60
Activity       77.62
Name           76.32
Sex            77.70
Age            86.51
Injury         75.61
Fatal (Y/N)    77.60
Time           88.54
Species        86.53
dtype: float64%

### Dropping nan rows

- We are going to drop all the rows that don't contain any data.

In [6]:
#Checking shape before removing the rows

df.shape

(25723, 14)

In [7]:
# DROPNA: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.dropna.html

df.dropna(axis=0,how="all",inplace=True)
df.shape

(6302, 14)

Checking the % of values in each column from the updated dataframe

In [8]:
nan_values = round(100*(df.isnull().sum() / len(df)),2)
print(f"Percentage of nan values within the column: \n \n {nan_values}%")

Percentage of nan values within the column:

 Date            0.00
Year            0.03
Type            0.06
Country         0.79
Area            7.22
Location        8.57
Activity        8.63
Name            3.33
Sex             8.97
Age            44.92
Injury          0.44
Fatal (Y/N)     8.55
Time           53.22
Species        45.03
dtype: float64%

## Column cleaning

### Function to check column values

We have created a function that enables us to have a quick look at some relevant kpi's from a column and its values. Fins below the information we are extracting with this function:

- TOTAL NUMBER OF ROWS
- NUMBER OF UNIQUE VALUES
- NUMBER OF UNIQUE VALUES DIVIDED BY TOTAL VALUES
- % OF NAN VALUES IS
- COLUMN DATA TYPE
- COLUMN UNIQUE VALUES
- VARIABLE WEIGHT WITHIN THE TOTAL OF THE COLUMN

In [9]:
def column_explore (x):
    
    print("TOTAL NUMBER OF ROWS: ",len(x),"\n")
    print("- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n")
    print("NUMBER OF UNIQUE VALUES:",x.nunique(),"\n")
    print("- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n")
    print("NUMBER OF UNIQUE VALUES DIVIDED BY TOTAL VALUES:",round((x.nunique()/len(x)*100),2),"%\n")
    print("- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n")
    print("% OF NAN VALUES IS: ",round(100*(x.isnull().sum() / len(x)),2),"%\n")
    print("- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n")
    print("COLUMN DATA TYPE: ",x.dtype,"\n")
    print("- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n")
    print("COLUMN UNIQUE VALUES: \n \n",x.unique(),"\n")
    print("- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n")
    print("VARIABLE WEIGHT WITHIN THE TOTAL OF THE COLUMN: \n \n",round((x.value_counts() / x.value_counts().sum())*100,2),"\n")
    print("- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n")

In [10]:
df.columns

Index(['Date', 'Year', 'Type', 'Country', 'Area', 'Location', 'Activity',
       'Name', 'Sex ', 'Age', 'Injury', 'Fatal (Y/N)', 'Time', 'Species '],
      dtype='object')

In [11]:
# Example: 

column_explore(df["Species "])

TOTAL NUMBER OF ROWS:  6302

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES: 1549

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES DIVIDED BY TOTAL VALUES: 24.58 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

% OF NAN VALUES IS:  45.03 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN DATA TYPE:  object

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN UNIQUE VALUES:

 ['White shark' nan '2 m shark' ... "12' tiger shark" 'Blue pointers'
 'Said to involve a grey nurse shark that leapt out of the water and  seized the boy but species identification is questionable']

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

VARIABLE WEIGHT WITHIN THE TOTAL OF THE COLUMN:

 White shark                                                                                                                      4.71
Shark involvement prior to death was not confirmed                                                                               3.03
Invalid                                                                                                                          2.94
Shark involvement not confirmed                                                                                                  2.54
Tiger shark                                                                                                                      2.11
                                                                                                                                 ...
1.2 m to 1.5 m [4.5' to 5'] shark                                                                                                0.03
Bull shark, 2.3 m [7.5']                                                                                                         0.03
0.9 m  [3'] shark                                                                                                                0.03
Mako shark, 14'                                                                                                                  0.03
Said to involve a grey nurse shark that leapt out of the water and  seized the boy but species identification is questionable    0.03
Name: Species , Length: 1549, dtype: float64

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

### Cleaning column names

Using the function shared above, we have noticed that two column names have speces on it. Making it more complicated to navigate or llok for them in some functions

 - 'Species ' & 'Sex '
 
We are going to also edit some of the names of the columns so they would be more accesible

In [12]:
df.columns

Index(['Date', 'Year', 'Type', 'Country', 'Area', 'Location', 'Activity',
       'Name', 'Sex ', 'Age', 'Injury', 'Fatal (Y/N)', 'Time', 'Species '],
      dtype='object')

In [13]:
#https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.rename.html

df.rename(columns={"Species ":"Species","Sex ":"Sex","Fatal (Y/N)":"Fatal"},inplace=True)
df.tail(7)

,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Injury,Fatal,Time,Species
6295,Before 1906,0.0,Unprovoked,AUSTRALIA,NaN,NaN,Fishing,fisherman,M,NaN,FATAL,Y,NaN,Blue pointers
6296,Before 1906,0.0,Unprovoked,AUSTRALIA,New South Wales,,Swimming,Arab boy,M,NaN,FATAL,Y,NaN,Said to involve a grey nurse shark that leapt ...
6297,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,Roebuck Bay,Diving,male,M,NaN,FATAL,Y,NaN,NaN
6298,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,NaN,Pearl diving,Ahmun,M,NaN,FATAL,Y,NaN,NaN
6299,1900-1905,0.0,Unprovoked,USA,North Carolina,Ocracoke Inlet,Swimming,Coast Guard personnel,M,NaN,FATAL,Y,NaN,NaN
6300,1883-1889,0.0,Unprovoked,PANAMA,NaN,"Panama Bay 8ºN, 79ºW",NaN,Jules Patterson,M,NaN,FATAL,Y,NaN,NaN
6301,1845-1853,0.0,Unprovoked,CEYLON (SRI LANKA),Eastern Province,"Below the English fort, Trincomalee",Swimming,male,M,15,"FATAL. ""Shark bit him in half, carrying away t...",Y,NaN,NaN

### Cleaning column values

In this section we are going to perform the cleaning of the variables inside the columns so we can better analyse them afterwards

#### Date & Month

- First we explore the column values with the function "column_explore"

In [14]:
column_explore(df["Date"])

TOTAL NUMBER OF ROWS:  6302

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES: 5433

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES DIVIDED BY TOTAL VALUES: 86.21 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

% OF NAN VALUES IS:  0.0 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN DATA TYPE:  object

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN UNIQUE VALUES:

 ['25-Jun-2018' '18-Jun-2018' '09-Jun-2018' ... '1900-1905' '1883-1889'
 '1845-1853']

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

VARIABLE WEIGHT WITHIN THE TOTAL OF THE COLUMN:

 1957                          0.17
1942                          0.14
1956                          0.13
1958                          0.11
1950                          0.11
                              ...
01-Dec-1994                   0.02
Reported      10-Dec-1994     0.02
11-Dec-1994                   0.02
13-Dec-1994                   0.02
1845-1853                     0.02
Name: Date, Length: 5433, dtype: float64

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

After seeing the data, we have decidet to clean this column and create a new one from it. Called moth

In order to clean this variable we will have to eprform the following changes: 
- Remove the word "reported" and "Before"
- Get rid of the year. We already have it the fowwoing column, 
- We will focus on the month, since we don't have any interest on the day

In [15]:
# Removing "Reported" & "Before"

df["Date"] = df["Date"].str.replace("Reported","")
df["Date"] = df["Date"].str.replace("Before","")
df["Date"]

0       25-Jun-2018
1       18-Jun-2018
2       09-Jun-2018
3       08-Jun-2018
4       04-Jun-2018
           ...
6297           1903
6298           1903
6299      1900-1905
6300      1883-1889
6301      1845-1853
Name: Date, Length: 6302, dtype: object

In [16]:
df['month'] = df['Date'].apply(lambda x: re.search(r'-(\w+)-', x).group(1) if re.search(r'-(\w+)-', x) else "month_not_found")
df['month'].sample(20)

1585                May
1306                Dec
1033                Apr
4540                Sep
2165                Sep
693                 Mar
3110                Nov
5514    month_not_found
5226                Apr
1200                Sep
1133                Apr
5222                Jul
1924                Aug
6131                Dec
2008                Sep
3593                Jan
6295    month_not_found
6219    month_not_found
6167    month_not_found
5835                Mar
Name: month, dtype: object

In [17]:
column_explore(df["month"])

TOTAL NUMBER OF ROWS:  6302

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES: 23

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES DIVIDED BY TOTAL VALUES: 0.36 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

% OF NAN VALUES IS:  0.0 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN DATA TYPE:  object

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN UNIQUE VALUES:

 ['Jun' 'May' 'month_not_found' 'Apr' 'Mar' 'Feb' 'Jan' 'Dec' 'Nov' 'Oct'
 'Sep' 'Aug' 'Jul' 'July' 'Ap' '30' '26' 'March' 'Sept' '24' '17' '13'
 '28']

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

VARIABLE WEIGHT WITHIN THE TOTAL OF THE COLUMN:

 month_not_found    14.20
Jul                 9.85
Aug                 8.82
Sep                 8.27
Jan                 7.84
Jun                 7.54
Apr                 6.66
Oct                 6.62
Dec                 6.59
Mar                 6.05
Nov                 6.00
May                 5.68
Feb                 5.65
July                0.06
Sept                0.03
Ap                  0.03
26                  0.02
March               0.02
30                  0.02
24                  0.02
17                  0.02
13                  0.02
28                  0.02
Name: month, dtype: float64

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

As we can see, we will have to deal with 15% of missing data. 

On the other hand we are going to clean this new column a litte bit by:

- Modify July,Sept and March so they can fit into their corrsponsding month
- Add the random numbers into "month_not_found"

In [18]:
# Updating months

df["month"] = df["month"].str.replace("July","Jul").str.replace("Sept","Sep").str.replace("March","Mar").str.replace("Ap","Apr").str.replace("Aprr","Apr")
column_explore(df["month"])

TOTAL NUMBER OF ROWS:  6302

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES: 19

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES DIVIDED BY TOTAL VALUES: 0.3 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

% OF NAN VALUES IS:  0.0 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN DATA TYPE:  object

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN UNIQUE VALUES:

 ['Jun' 'May' 'month_not_found' 'Apr' 'Mar' 'Feb' 'Jan' 'Dec' 'Nov' 'Oct'
 'Sep' 'Aug' 'Jul' '30' '26' '24' '17' '13' '28']

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

VARIABLE WEIGHT WITHIN THE TOTAL OF THE COLUMN:

 month_not_found    14.20
Jul                 9.92
Aug                 8.82
Sep                 8.30
Jan                 7.84
Jun                 7.54
Apr                 6.70
Oct                 6.62
Dec                 6.59
Mar                 6.06
Nov                 6.00
May                 5.68
Feb                 5.65
30                  0.02
26                  0.02
24                  0.02
17                  0.02
13                  0.02
28                  0.02
Name: month, dtype: float64

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

In [19]:
# Updating days

df["month"] = df["month"].str.replace("30","month_not_found").str.replace("26","month_not_found").str.replace("24","month_not_found").str.replace("17","month_not_found").str.replace("13","month_not_found").str.replace("28","month_not_found")
column_explore(df["month"])

TOTAL NUMBER OF ROWS:  6302

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES: 13

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES DIVIDED BY TOTAL VALUES: 0.21 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

% OF NAN VALUES IS:  0.0 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN DATA TYPE:  object

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN UNIQUE VALUES:

 ['Jun' 'May' 'month_not_found' 'Apr' 'Mar' 'Feb' 'Jan' 'Dec' 'Nov' 'Oct'
 'Sep' 'Aug' 'Jul']

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

VARIABLE WEIGHT WITHIN THE TOTAL OF THE COLUMN:

 month_not_found    14.30
Jul                 9.92
Aug                 8.82
Sep                 8.30
Jan                 7.84
Jun                 7.54
Apr                 6.70
Oct                 6.62
Dec                 6.59
Mar                 6.06
Nov                 6.00
May                 5.68
Feb                 5.65
Name: month, dtype: float64

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

#### Year

First, let's explore the column values

In [20]:
column_explore(df["Year"])

TOTAL NUMBER OF ROWS:  6302

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES: 249

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES DIVIDED BY TOTAL VALUES: 3.95 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

% OF NAN VALUES IS:  0.03 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN DATA TYPE:  float64

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN UNIQUE VALUES:

 [2018. 2017.   nan 2016. 2015. 2014. 2013. 2012. 2011. 2010. 2009. 2008.
 2007. 2006. 2005. 2004. 2003. 2002. 2001. 2000. 1999. 1998. 1997. 1996.
 1995. 1984. 1994. 1993. 1992. 1991. 1990. 1989. 1969. 1988. 1987. 1986.
 1985. 1983. 1982. 1981. 1980. 1979. 1978. 1977. 1976. 1975. 1974. 1973.
 1972. 1971. 1970. 1968. 1967. 1966. 1965. 1964. 1963. 1962. 1961. 1960.
 1959. 1958. 1957. 1956. 1955. 1954. 1953. 1952. 1951. 1950. 1949. 1948.
 1848. 1947. 1946. 1945. 1944. 1943. 1942. 1941. 1940. 1939. 1938. 1937.
 1936. 1935. 1934. 1933. 1932. 1931. 1930. 1929. 1928. 1927. 1926. 1925.
 1924. 1923. 1922. 1921. 1920. 1919. 1918. 1917. 1916. 1915. 1914. 1913.
 1912. 1911. 1910. 1909. 1908. 1907. 1906. 1905. 1904. 1903. 1902. 1901.
 1900. 1899. 1898. 1897. 1896. 1895. 1894. 1893. 1892. 1891. 1890. 1889.
 1888. 1887. 1886. 1885. 1884. 1883. 1882. 1881. 1880. 1879. 1878. 1877.
 1876. 1875. 1874. 1873. 1872. 1871. 1870. 1869. 1868. 1867. 1866. 1865.
 1864. 1863. 1862. 1861. 1860. 1859. 1858. 1857. 1856. 1855. 1853. 1852.
 1851. 1850. 1849. 1847. 1846. 1845. 1844. 1842. 1841. 1840. 1839. 1837.
 1836. 1835. 1834. 1832. 1831. 1830. 1829. 1828. 1827. 1826. 1825. 1823.
 1822. 1819. 1818. 1817. 1816. 1815. 1812. 1811. 1810. 1808. 1807. 1805.
 1804. 1803. 1802. 1801. 1800. 1797. 1792. 1791. 1788. 1787. 1786. 1785.
 1784. 1783. 1780. 1779. 1776. 1771. 1767. 1764. 1758. 1753. 1751. 1749.
 1755. 1748. 1742. 1738. 1733. 1723. 1721. 1703. 1700. 1642. 1638. 1637.
 1617. 1595. 1580. 1555. 1554. 1543.  500.   77.    5.    0.]

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

VARIABLE WEIGHT WITHIN THE TOTAL OF THE COLUMN:

 2015.0    2.27
2017.0    2.16
2016.0    2.06
2011.0    2.03
2014.0    2.02
          ...
1786.0    0.02
1785.0    0.02
1784.0    0.02
1783.0    0.02
1815.0    0.02
Name: Year, Length: 249, dtype: float64

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

Fist we get rid of the .0 from the end of the years

In [21]:
df["Year"] = df["Year"].astype("str").str.split(".").str[0]
df["Year"]

0       2018
1       2018
2       2018
3       2018
4       2018
        ...
6297       0
6298       0
6299       0
6300       0
6301       0
Name: Year, Length: 6302, dtype: object

In [22]:
df["Year"] = df["Year"].str.replace("nan","0")

Now, we get rid of the corrupted values like "500"

In [23]:
# admissions["decision2"] = admissions["SOP"].apply(lambda x: 1 if x > 3 else 0)

df["Year"] = df["Year"].apply(lambda x: "nan" if int(x) < 1000 else x)
df["Year"].unique()

array(['2018', '2017', 'nan', '2016', '2015', '2014', '2013', '2012',
       '2011', '2010', '2009', '2008', '2007', '2006', '2005', '2004',
       '2003', '2002', '2001', '2000', '1999', '1998', '1997', '1996',
       '1995', '1984', '1994', '1993', '1992', '1991', '1990', '1989',
       '1969', '1988', '1987', '1986', '1985', '1983', '1982', '1981',
       '1980', '1979', '1978', '1977', '1976', '1975', '1974', '1973',
       '1972', '1971', '1970', '1968', '1967', '1966', '1965', '1964',
       '1963', '1962', '1961', '1960', '1959', '1958', '1957', '1956',
       '1955', '1954', '1953', '1952', '1951', '1950', '1949', '1948',
       '1848', '1947', '1946', '1945', '1944', '1943', '1942', '1941',
       '1940', '1939', '1938', '1937', '1936', '1935', '1934', '1933',
       '1932', '1931', '1930', '1929', '1928', '1927', '1926', '1925',
       '1924', '1923', '1922', '1921', '1920', '1919', '1918', '1917',
       '1916', '1915', '1914', '1913', '1912', '1911', '1910', '1909',
       '1908', '1907', '1906', '1905', '1904', '1903', '1902', '1901',
       '1900', '1899', '1898', '1897', '1896', '1895', '1894', '1893',
       '1892', '1891', '1890', '1889', '1888', '1887', '1886', '1885',
       '1884', '1883', '1882', '1881', '1880', '1879', '1878', '1877',
       '1876', '1875', '1874', '1873', '1872', '1871', '1870', '1869',
       '1868', '1867', '1866', '1865', '1864', '1863', '1862', '1861',
       '1860', '1859', '1858', '1857', '1856', '1855', '1853', '1852',
       '1851', '1850', '1849', '1847', '1846', '1845', '1844', '1842',
       '1841', '1840', '1839', '1837', '1836', '1835', '1834', '1832',
       '1831', '1830', '1829', '1828', '1827', '1826', '1825', '1823',
       '1822', '1819', '1818', '1817', '1816', '1815', '1812', '1811',
       '1810', '1808', '1807', '1805', '1804', '1803', '1802', '1801',
       '1800', '1797', '1792', '1791', '1788', '1787', '1786', '1785',
       '1784', '1783', '1780', '1779', '1776', '1771', '1767', '1764',
       '1758', '1753', '1751', '1749', '1755', '1748', '1742', '1738',
       '1733', '1723', '1721', '1703', '1700', '1642', '1638', '1637',
       '1617', '1595', '1580', '1555', '1554', '1543'], dtype=object)

#### Type

In [24]:
column_explore(df["Type"])

TOTAL NUMBER OF ROWS:  6302

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES: 8

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES DIVIDED BY TOTAL VALUES: 0.13 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

% OF NAN VALUES IS:  0.06 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN DATA TYPE:  object

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN UNIQUE VALUES:

 ['Boating' 'Unprovoked' 'Invalid' 'Provoked' 'Questionable' 'Sea Disaster'
 nan 'Boat' 'Boatomg']

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

VARIABLE WEIGHT WITHIN THE TOTAL OF THE COLUMN:

 Unprovoked      72.96
Provoked         9.11
Invalid          8.69
Sea Disaster     3.79
Boating          3.22
Boat             2.18
Questionable     0.03
Boatomg          0.02
Name: Type, dtype: float64

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

In [25]:
# Grouping variables

df["Type"] = df["Type"].apply(lambda x: str(x) if not isinstance(x, str) else x)
df["Type"] = df["Type"].apply(lambda x: re.sub(r"\bBoat\b", "Boating", x))
df["Type"] = df["Type"].apply(lambda x: re.sub(r"\bBoatomg\b", "Boating", x))
df["Type"].unique()

array(['Boating', 'Unprovoked', 'Invalid', 'Provoked', 'Questionable',
       'Sea Disaster', 'nan'], dtype=object)

#### Sex

In [26]:
#df.head()

column_explore(df["Sex"])

#df["Activity"].sample(20)

TOTAL NUMBER OF ROWS:  6302

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES: 6

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES DIVIDED BY TOTAL VALUES: 0.1 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

% OF NAN VALUES IS:  8.97 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN DATA TYPE:  object

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN UNIQUE VALUES:

 ['F' 'M' nan 'M ' 'lli' 'N' '.']

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

VARIABLE WEIGHT WITHIN THE TOTAL OF THE COLUMN:

 M      88.79
F      11.10
M       0.03
N       0.03
lli     0.02
.       0.02
Name: Sex, dtype: float64

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

In [27]:

df["Sex"] = df["Sex"].str.strip()
df["Sex"].unique()

array(['F', 'M', nan, 'lli', 'N', '.'], dtype=object)

#### Fatal

In [28]:
column_explore(df["Fatal"])

TOTAL NUMBER OF ROWS:  6302

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES: 8

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES DIVIDED BY TOTAL VALUES: 0.13 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

% OF NAN VALUES IS:  8.55 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN DATA TYPE:  object

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN UNIQUE VALUES:

 ['N' 'Y' nan 'M' 'UNKNOWN' '2017' ' N' 'N ' 'y']

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

VARIABLE WEIGHT WITHIN THE TOTAL OF THE COLUMN:

 N          74.49
Y          24.08
UNKNOWN     1.23
 N          0.12
M           0.02
2017        0.02
N           0.02
y           0.02
Name: Fatal, dtype: float64

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

In [29]:
df["Fatal"] = df["Fatal"].str.strip()
df["Fatal"] = df["Fatal"].str.upper()

df["Fatal"].unique()

array(['N', 'Y', nan, 'M', 'UNKNOWN', '2017'], dtype=object)

In [30]:
df.head()

,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Injury,Fatal,Time,Species,month
0,25-Jun-2018,2018,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,"No injury to occupant, outrigger canoe and pad...",N,18h00,White shark,Jun
1,18-Jun-2018,2018,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,Adyson McNeely,F,11,Minor injury to left thigh,N,14h00 -15h00,NaN,Jun
2,09-Jun-2018,2018,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,John Denges,M,48,Injury to left lower leg from surfboard skeg,N,07h45,NaN,Jun
3,08-Jun-2018,2018,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,Surfing,male,M,NaN,Minor injury to lower leg,N,NaN,2 m shark,Jun
4,04-Jun-2018,2018,Provoked,MEXICO,Colima,La Ticla,Free diving,Gustavo Ramos,M,NaN,Lacerations to leg & hand shark PROVOKED INCIDENT,N,NaN,"Tiger shark, 3m",Jun

In [32]:
# Trying to fill blanks in fatal with loop


#ASK IN CLASS
'''
for i in df["injury"]:
    if df["Fatal"] == "" and "fatal" in i.lower():
        df["Fatal"] = "Y"
    elif df["Fatal"] == "" and "fatal" not in i.lower():
        df["Fatal"] = "N"
'''   

for index, row in df.iterrows():
    if df.at[index, "Fatal"] == "" and "fatal" in row["Injury"].lower():
        df.at[index, "Fatal"] = "Y"
    elif df.at[index, "Fatal"] == "" and "fatal" not in row["Injury"].lower():
        df.at[index, "Fatal"] = "N"

column_explore(df["Fatal"])

TOTAL NUMBER OF ROWS:  6302

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES: 5

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

NUMBER OF UNIQUE VALUES DIVIDED BY TOTAL VALUES: 0.08 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

% OF NAN VALUES IS:  8.55 %

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN DATA TYPE:  object

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

COLUMN UNIQUE VALUES:

 ['N' 'Y' nan 'M' 'UNKNOWN' '2017']

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

VARIABLE WEIGHT WITHIN THE TOTAL OF THE COLUMN:

 N          74.63
Y          24.10
UNKNOWN     1.23
M           0.02
2017        0.02
Name: Fatal, dtype: float64

- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

## Remove duplicate values

First, a quick check of the duplicated values of the df:

In [39]:
df.duplicated().sum()

2

Now, we remove this duplicated values

In [42]:
# Drop duplicates link: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop_duplicates.html

df.drop_duplicates(inplace=True)
df.duplicated().sum()

0

## Exporting cleaned data

In [43]:
df.to_csv(r"C:\Users\DavidVicente\Desktop\IronHack\Projects\Project 1\clean_df.csv", index= False)